Cylinder/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1.0;

vertices
(
    (0.5 0 -0.5)
    (0.353553 0.353553 -0.5)
    (0 0.5 -0.5)
    (-0.353553 0.353553 -0.5)
    (-0.5 0 -0.5)
    (-0.353553 -0.353553 -0.5)
    (0 -0.5 -0.5)
    (0.353553 -0.353553 -0.5)
    (1 0 -0.5)
    (0.707101 0.707101 -0.5)
    (0 1 -0.5)
    (-0.707101 0.707101 -0.5)
    (-1 0 -0.5)
    (-0.707101 -0.707101 -0.5)
    (0 -1 -0.5)
    (0.707101 -0.707101 -0.5)
    (20 0 -0.5)
    (20 0.707101 -0.5)
    (20 6 -0.5)
    (0.707101 6 -0.5)
    (0 6 -0.5)
    (-0.707101 6 -0.5)
    (-10 6 -0.5)
    (-10 0.707101 -0.5)
    (-10 0 -0.5)
    (-10 -0.707101 -0.5)
    (-10 -6 -0.5)
    (-0.707101 -6 -0.5)
    (0 -6 -0.5)
    (0.707101 -6 -0.5)
    (20 -6 -0.5)
    (20 -0.707101 -0.5)
    (0.5 0 0.5)
    (0.353553 0.353553 0.5)
    (0 0.5 0.5)
    (-0.353553 0.353553 0.5)
    (-0.5 0 0.5)
    (-0.353553 -0.353553 0.5)
    (0 -0.5 0.5)
    (0.353553 -0.353553 0.5)
    (1 0 0.5)
    (0.707101 0.707101 0.5)
    (0 1 0.5)
    (-0.707101 0.707101 0.5)
    (-1 0 0.5)
    (-0.707101 -0.707101 0.5)
    (0 -1 0.5)
    (0.707101 -0.707101 0.5)
    (20 0 0.5)
    (20 0.707101 0.5)
    (20 6 0.5)
    (0.707101 6 0.5)
    (0 6 0.5)
    (-0.707101 6 0.5)
    (-10 6 0.5)
    (-10 0.707101 0.5)
    (-10 0 0.5)
    (-10 -0.707101 0.5)
    (-10 -6 0.5)
    (-0.707101 -6 0.5)
    (0 -6 0.5)
    (0.707101 -6 0.5)
    (20 -6 0.5)
    (20 -0.707101 0.5)
);

blocks
(
    hex (0 8 9 1 32 40 41 33) (5 5 1) simpleGrading (1 1 1)
    hex (2 1 9 10 34 33 41 42) (5 5 1) simpleGrading (1 1 1)
    hex (3 2 10 11 35 34 42 43) (5 5 1) simpleGrading (1 1 1)
    hex (12 4 3 11 44 36 35 43) (5 5 1) simpleGrading (1 1 1)
    hex (13 5 4 12 45 37 36 44) (5 5 1) simpleGrading (1 1 1)
    hex (13 14 6 5 45 46 38 37) (5 5 1) simpleGrading (1 1 1)
    hex (14 15 7 6 46 47 39 38) (5 5 1) simpleGrading (1 1 1)
    hex (7 15 8 0 39 47 40 32) (5 5 1) simpleGrading (1 1 1)
    hex (8 16 17 9 40 48 49 41) (100 5 1) simpleGrading (1 1 1)
    hex (9 17 18 19 41 49 50 51) (100 25 1) simpleGrading (1 1 1)
    hex (10 9 19 20 42 41 51 52) (5 25 1) simpleGrading (1 1 1)
    hex (11 10 20 21 43 42 52 53) (5 25 1) simpleGrading (1 1 1)
    hex (23 11 21 22 55 43 53 54) (50 25 1) simpleGrading (1 1 1)
    hex (24 12 11 23 56 44 43 55) (50 5 1) simpleGrading (1 1 1)
    hex (25 13 12 24 57 45 44 56) (50 5 1) simpleGrading (1 1 1)
    hex (26 27 13 25 58 59 45 57) (50 25 1) simpleGrading (1 1 1)
    hex (27 28 14 13 59 60 46 45) (5 25 1) simpleGrading (1 1 1)
    hex (28 29 15 14 60 61 47 46) (5 25 1) simpleGrading (1 1 1)
    hex (29 30 31 15 61 62 63 47) (100 25 1) simpleGrading (1 1 1)
    hex (15 31 16 8 47 63 48 40) (100 5 1) simpleGrading (1 1 1)
);

edges
(
    arc 0 1 (0.461940 0.191342 -0.5)
    arc 1 2 (0.191342 0.461940 -0.5)
    arc 2 3 (-0.191342 0.461940 -0.5)
    arc 3 4 (-0.461940 0.191342 -0.5)
    arc 4 5 (-0.461940 -0.191342 -0.5)
    arc 5 6 (-0.191342 -0.461940 -0.5)
    arc 6 7 (0.191342 -0.461940 -0.5)
    arc 7 0 (0.461940 -0.191342 -0.5)
    arc 8 9 (0.923880 0.382683 -0.5)
    arc 9 10 (0.382683 0.923880 -0.5)
    arc 10 11 (-0.382683 0.923880 -0.5)
    arc 11 12 (-0.923880 0.382683 -0.5)
    arc 12 13 (-0.923880 -0.382683 -0.5)
    arc 13 14 (-0.382683 -0.923880 -0.5)
    arc 14 15 (0.382683 -0.923880 -0.5)
    arc 15 8 (0.923880 -0.382683 -0.5)
    arc 32 33 (0.461940 0.191342 0.5)
    arc 33 34 (0.191342 0.461940 0.5)
    arc 34 35 (-0.191342 0.461940 0.5)
    arc 35 36 (-0.461940 0.191342 0.5)
    arc 36 37 (-0.461940 -0.191342 0.5)
    arc 37 38 (-0.191342 -0.461940 0.5)
    arc 38 39 (0.191342 -0.461940 0.5)
    arc 39 32 (0.461940 -0.191342 0.5)
    arc 40 41 (0.923880 0.382683 0.5)
    arc 41 42 (0.382683 0.923880 0.5)
    arc 42 43 (-0.382683 0.923880 0.5)
    arc 43 44 (-0.923880 0.382683 0.5)
    arc 44 45 (-0.923880 -0.382683 0.5)
    arc 45 46 (-0.382683 -0.923880 0.5)
    arc 46 47 (0.382683 -0.923880 0.5)
    arc 47 40 (0.923880 -0.382683 0.5)
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (22 54 55 23)
            (23 55 56 24)
            (24 56 57 25)
            (25 57 58 26)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (17 49 50 18)
            (16 48 49 17)
            (31 63 48 16)
            (30 62 63 31)
        );
    }
    upperWall
    {
        type symmetryPlane;
        faces
        (
            (18 50 51 19)
            (19 51 52 20)
            (20 52 53 21)
            (21 53 54 22)
        );
    }
    lowerWall
    {
        type symmetryPlane;
        faces
        (
            (26 58 59 27)
            (27 59 60 28)
            (28 60 61 29)
            (29 61 62 30)
        );
    }
    cylinder
    {
        type Wall;
        faces
        (
            (0 1 33 32)
            (1 2 34 33)
            (2 3 35 34)
            (3 4 36 35)
            (4 5 37 36)
            (5 6 38 37)
            (6 7 39 38)
            (7 0 32 39)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 8 9 1)
            (1 9 10 2)
            (2 10 11 3)
            (3 11 12 4)
            (4 12 13 5)
            (5 13 14 6)
            (6 14 15 7)
            (7 15 8 0)
            (8 16 17 9)
            (9 17 18 19)
            (9 19 20 10)
            (10 20 21 11)
            (11 21 22 23)
            (11 23 24 12)
            (12 24 25 13)
            (13 25 26 27)
            (13 27 28 14)
            (14 28 29 15)
            (15 29 30 31)
            (15 31 16 8)
            (32 33 41 40)
            (33 34 42 41)
            (34 35 43 42)
            (35 36 44 43)
            (36 37 45 44)
            (37 38 46 45)
            (38 39 47 46)
            (39 32 40 47)
            (40 41 49 48)
            (41 51 50 49)
            (41 42 52 51)
            (42 43 53 52)
            (43 55 54 53)
            (43 44 56 55)
            (44 45 57 56)
            (45 59 58 57)
            (45 46 60 59)
            (46 47 61 60)
            (47 63 62 61)
            (47 40 48 63)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
