Cylinder/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9                                   	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
/*
    p
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-06;
        relTol          0;
	minIter 	2;
    }
*/

/*
    p
    {
        solver          PCG;
        preconditioner
        {
            preconditioner  GAMG;
            tolerance       1e-06;
            relTol          0;
            smoother        GaussSeidel;
            nPreSweeps      0;
            nPostSweeps     2;
            nFinestSweeps   2;
            cacheAgglomeration on;
            nCellsInCoarsestLevel 10;
            agglomerator    faceAreaPair;
            mergeLevels     1;
        }
        tolerance       1e-06;
        relTol          0.01;
	minIter 	2;
    }
*/

    p
    {
        solver           GAMG;
        tolerance        1e-6;
        relTol           0;
        smoother         GaussSeidel;
        nPreSweeps       0;
        nPostSweeps      2;
        cacheAgglomeration on;
        agglomerator     faceAreaPair;
        nCellsInCoarsestLevel 100;
        mergeLevels      1;
	minIter 	2;
    }

    pFinal
    {
        $p;
        relTol          0;
	minIter 	2;
    }

    "(U|UFinal)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-08;
        relTol          0;
    }

/*
    "(U|UFinal)"
    {
        type            coupled;
        solver          PBiCCCG;
        preconditioner  DILU;
        tolerance       (1e-08 1e-08 1e-08);
        relTol          (0 0 0);
    }
*/
}

PIMPLE
{
    //If enable you will need to add UFinal
    momentumPredictor yes;

    //Use consistent formulation of SIMPLE - More robust
    consistent 		yes; 

    //If you set nOuterCorrectors to 1 is equivalent to piso    
    nOuterCorrectors 2;

    nCorrectors 2;
    nNonOrthogonalCorrectors 2;

    //pRefCell        0;
    //pRefValue       0;
}

relaxationFactors
{
    fields
    {
        ".*"   0.9;  // ensure diagonal equality
    }
    equations
    {
        ".*"   0.9;  // ensure diagonal equality
    }
}

// ************************************************************************* //
